spec/fixtures/vcr_cassettes/webhook_payment_success_zero.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_invoice_payment_succeeded
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.18.0
      Authorization:
      - Bearer sk_test_6uBq0SMfkKrgiBZ4ZWPVSGgN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.18.0","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Roccos-iMac.local 13.4.0 Darwin Kernel Version 13.4.0: Sun Aug 17 19:50:11
        PDT 2014; root:xnu-2422.115.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 404
      message: Not Found
    headers:
      Server:
      - nginx
      Date:
      - Sat, 07 Mar 2015 22:12:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '139'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_GYduDrKYsmCluB7d
      Stripe-Version:
      - '2014-11-05'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "No such event: evt_invoice_payment_succeeded",
            "param": "id"
          }
        }
    http_version: 
  recorded_at: Sat, 07 Mar 2015 22:12:24 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/in_15bcxYAQkfalJzyKt9NVxqoy
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.18.0
      Authorization:
      - Bearer sk_test_6uBq0SMfkKrgiBZ4ZWPVSGgN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.18.0","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Roccos-iMac.local 13.4.0 Darwin Kernel Version 13.4.0: Sun Aug 17 19:50:11
        PDT 2014; root:xnu-2422.115.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 07 Mar 2015 22:27:01 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1829'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_LAb6puUaWFvLWMDJ
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1425238960,
          "id": "in_15bcxYAQkfalJzyKt9NVxqoy",
          "period_start": 1425238960,
          "period_end": 1425238960,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_15bcxYAQkfalJzyKt9NVxqoy/lines",
            "data": [
              {
                "id": "sub_5nDO3YJ2wW9nzR",
                "object": "line_item",
                "type": "subscription",
                "livemode": false,
                "amount": 2499,
                "currency": "eur",
                "proration": false,
                "period": {
                  "start": 1425238960,
                  "end": 1427917360
                },
                "subscription": null,
                "quantity": 1,
                "plan": {
                  "interval": "month",
                  "name": "Up\u0026Sell.Me",
                  "created": 1425132625,
                  "amount": 2499,
                  "currency": "eur",
                  "id": "MONTHLY_PLAN",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_descriptor": null,
                  "statement_description": null
                },
                "description": null,
                "metadata": {}
              }
            ]
          },
          "subtotal": 2499,
          "total": 2499,
          "customer": "cus_5nDOObvDCZYY9t",
          "object": "invoice",
          "attempted": true,
          "closed": true,
          "forgiven": false,
          "paid": true,
          "livemode": false,
          "attempt_count": 1,
          "amount_due": 2499,
          "currency": "eur",
          "starting_balance": 0,
          "ending_balance": 0,
          "next_payment_attempt": null,
          "webhooks_delivered_at": 1425238966,
          "charge": "ch_15bcxYAQkfalJzyKZFDQPp6H",
          "discount": null,
          "application_fee": null,
          "subscription": "sub_5nDO3YJ2wW9nzR",
          "tax_percent": null,
          "tax": null,
          "metadata": {},
          "statement_descriptor": null,
          "description": null,
          "receipt_number": null,
          "statement_description": null
        }
    http_version: 
  recorded_at: Sat, 07 Mar 2015 22:26:59 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_15bcxYAQkfalJzyKZFDQPp6H
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.18.0
      Authorization:
      - Bearer sk_test_6uBq0SMfkKrgiBZ4ZWPVSGgN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.18.0","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Roccos-iMac.local 13.4.0 Darwin Kernel Version 13.4.0: Sun Aug 17 19:50:11
        PDT 2014; root:xnu-2422.115.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 07 Mar 2015 22:27:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2048'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_QPQBfzh0xKgvdoJl
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15bcxYAQkfalJzyKZFDQPp6H",
          "object": "charge",
          "created": 1425238960,
          "livemode": false,
          "paid": true,
          "status": "paid",
          "amount": 2499,
          "currency": "eur",
          "refunded": false,
          "source": {
            "id": "card_15bcxSAQkfalJzyKvJBjb18X",
            "object": "card",
            "last4": "1111",
            "brand": "Visa",
            "funding": "unknown",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "hePZlOgPfVlt1Rqb",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": "cus_5nDOObvDCZYY9t"
          },
          "captured": true,
          "card": {
            "id": "card_15bcxSAQkfalJzyKvJBjb18X",
            "object": "card",
            "last4": "1111",
            "brand": "Visa",
            "funding": "unknown",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "hePZlOgPfVlt1Rqb",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": "cus_5nDOObvDCZYY9t"
          },
          "balance_transaction": "txn_15bcxYAQkfalJzyKv3vQBPeH",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_5nDOObvDCZYY9t",
          "invoice": "in_15bcxYAQkfalJzyKt9NVxqoy",
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_descriptor": null,
          "fraud_details": {},
          "receipt_email": "rocco@galluzzo.me",
          "receipt_number": null,
          "shipping": null,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_15bcxYAQkfalJzyKZFDQPp6H/refunds",
            "data": []
          },
          "statement_description": null
        }
    http_version: 
  recorded_at: Sat, 07 Mar 2015 22:27:01 GMT
recorded_with: VCR 2.9.3
