spec/fixtures/stripe_webhooks/evt_customer_subscription_trial_will_end.json

{
  "id": "evt_15bExKAQkfalJzyKEQhenP4G",
  "created": 1425146690,
  "livemode": true,
  "type": "customer.subscription.trial_will_end",
  "data": {
    "object": {
      "id": "sub_5iaJuKJj4X5CrU",
      "plan": {
        "interval": "month",
        "name": "Monthly App Plan",
        "created": 1419609668,
        "amount": 2499,
        "currency": "eur",
        "id": "MONTHLY_PLAN",
        "object": "plan",
        "livemode": true,
        "interval_count": 1,
        "trial_period_days": 30,
        "metadata": {},
        "statement_descriptor": "up&sell.me Subscriptio",
        "statement_description": "up&sell.me Subscriptio"
      },
      "object": "subscription",
      "start": 1424171033,
      "status": "trialing",
      "customer": "cus_test2",
      "cancel_at_period_end": false,
      "current_period_start": 1424171033,
      "current_period_end": 1425380632,
      "ended_at": null,
      "trial_start": 1424171033,
      "trial_end": 1425380632,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null,
      "discount": null,
      "tax_percent": null,
      "metadata": {}
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": null,
  "api_version": "2014-11-05"
}
