spec/fixtures/stripe_webhooks/evt_invoice_payment_succeeded.json

{
  "id": "evt_kfalJzyKq6yFaVjd",
  "created": 1425238960,
  "livemode": false,
  "type": "invoice.payment_succeeded",
  "data": {
    "object": {
      "date": 1425238960,
      "id": "in_15bcxYAQkfalJzyKt9NVxqoy",
      "period_start": 1425238960,
      "period_end": 1425238960,
      "lines": {
        "object": "list",
        "total_count": 1,
        "has_more": false,
        "url": "/v1/invoices/in_15bcxYAQkfalJzyKt9NVxqoy/lines",
        "data": [
          {
            "id": "sub_5nDO3YJ2wW9nzR",
            "object": "line_item",
            "type": "subscription",
            "livemode": false,
            "amount": 2499,
            "currency": "eur",
            "proration": false,
            "period": {
              "start": 1425238960,
              "end": 1427917360
            },
            "subscription": null,
            "quantity": 1,
            "plan": {
              "interval": "month",
              "name": "Up&Sell.Me",
              "created": 1425132625,
              "amount": 2499,
              "currency": "eur",
              "id": "MONTHLY_PLAN",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {},
              "statement_descriptor": null,
              "statement_description": null
            },
            "description": null,
            "metadata": {}
          }
        ]
      },
      "subtotal": 2499,
      "total": 2499,
      "customer": "cus_5nDOObvDCZYY9t",
      "object": "invoice",
      "attempted": true,
      "closed": true,
      "forgiven": false,
      "paid": true,
      "livemode": false,
      "attempt_count": 1,
      "amount_due": 2499,
      "currency": "eur",
      "starting_balance": 0,
      "ending_balance": 0,
      "next_payment_attempt": null,
      "webhooks_delivered_at": null,
      "charge": "ch_15bcxYAQkfalJzyKZFDQPp6H",
      "discount": null,
      "application_fee": null,
      "subscription": "sub_5nDO3YJ2wW9nzR",
      "tax_percent": null,
      "tax": null,
      "metadata": {},
      "statement_descriptor": null,
      "description": null,
      "receipt_number": null,
      "statement_description": null
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_5nDOD2syME0rGL",
  "api_version": "2014-11-05"
}